Revit 2026 API

# StructuralSectionGeneralRWallDesignThickness Property

---

Represents wall design thickness of rectangle.

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double WallDesignThickness { get; set; }
```
```vb
Public Property WallDesignThickness As Double
	Get
	Set
```
```cpp
public:
property double WallDesignThickness {
	double get ();
	void set (double value);
}
```
```fsharp
member WallDesignThickness : float with get, set
```

#### Property Value

Double

Design thickness of pipe wall is value should be thinner value than measured real value (nominal). In EN standard it is marked as "d". //Need to be verified!!!!!!! In ACI standard it is marked as "d". //Need to be verified!!!!!!!

#### Reference

StructuralSectionGeneralR Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace